In [3]:
import pandas as pd
import numpy as np

## Part1

In [4]:
ratings = pd.read_csv("./ml-20m/ratings.csv")
movies = pd.read_csv("./ml-20m/movies.csv")
tags = pd.read_csv("./ml-20m/tags.csv")

In [19]:
ratings.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [20]:
tags.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

In [22]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

## Part 2

In [23]:
tags.dtypes

userId        int64
movieId       int64
tag          object
timestamp     int64
dtype: object

In [24]:
tags.iloc[0].dtypes

dtype('O')

In [25]:
tags.iloc[0]

userId                18
movieId             4141
tag          Mark Waters
timestamp     1240597180
Name: 0, dtype: object

## Part3

In [28]:
tags.iloc[[0,11,2000]]

      userId  movieId                tag   timestamp
0         18     4141        Mark Waters  1240597180
11        65     1783      noir thriller  1368149983
2000     910    68554  conspiracy theory  1368043943

## Part5

In [30]:
ratings.describe()

             userId       movieId        rating     timestamp
count  2.000026e+07  2.000026e+07  2.000026e+07  2.000026e+07
mean   6.904587e+04  9.041567e+03  3.525529e+00  1.100918e+09
std    4.003863e+04  1.978948e+04  1.051989e+00  1.621694e+08
min    1.000000e+00  1.000000e+00  5.000000e-01  7.896520e+08
25%    3.439500e+04  9.020000e+02  3.000000e+00  9.667977e+08
50%    6.914100e+04  2.167000e+03  3.500000e+00  1.103556e+09
75%    1.036370e+05  4.770000e+03  4.000000e+00  1.225642e+09
max    1.384930e+05  1.312620e+05  5.000000e+00  1.427784e+09

In [43]:
len(ratings[["userId","movieId","rating","timestamp"]])

20000263

In [42]:
ratings[["userId","movieId","rating","timestamp"]].mean()

userId       6.904587e+04
movieId      9.041567e+03
rating       3.525529e+00
timestamp    1.100918e+09
dtype: float64

In [44]:
ratings[["userId","movieId","rating","timestamp"]].std()

userId       4.003863e+04
movieId      1.978948e+04
rating       1.051989e+00
timestamp    1.621694e+08
dtype: float64

In [45]:
ratings[["userId","movieId","rating","timestamp"]].min()

userId               1.0
movieId              1.0
rating               0.5
timestamp    789652004.0
dtype: float64

In [46]:
ratings[["userId","movieId","rating","timestamp"]].max()

userId       1.384930e+05
movieId      1.312620e+05
rating       5.000000e+00
timestamp    1.427784e+09
dtype: float64

In [47]:
ratings[["userId","movieId","rating","timestamp"]].quantile(0.25)

userId           34395.0
movieId            902.0
rating               3.0
timestamp    966797745.0
Name: 0.25, dtype: float64

In [48]:
ratings[["userId","movieId","rating","timestamp"]].quantile(0.5)

userId       6.914100e+04
movieId      2.167000e+03
rating       3.500000e+00
timestamp    1.103556e+09
Name: 0.5, dtype: float64

In [49]:
ratings[["userId","movieId","rating","timestamp"]].quantile(0.75)

userId       1.036370e+05
movieId      4.770000e+03
rating       4.000000e+00
timestamp    1.225642e+09
Name: 0.75, dtype: float64

## Part6

In [56]:
rating_new = ratings[ratings["rating"]>5]
rating_new.head()
len(rating_new)

0

## Part7

In [64]:
(ratings.isnull().sum())

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

## Part8

In [98]:
movies[(movies["genres"].str.find("Animation")) > 0].head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
12,13,Balto (1995),Adventure|Animation|Children
360,364,"Lion King, The (1994)",Adventure|Animation|Children|Drama|Musical|IMAX
388,392,"Secret Adventures of Tom Thumb, The (1993)",Adventure|Animation
553,558,"Pagemaster, The (1994)",Action|Adventure|Animation|Children|Fantasy

## Part9

In [101]:
ratings["rating"].mean()

3.5255285642993797

## Part 10

In [107]:
movies.merge(tags, on ="movieId").head()

,movieId,title,genres,userId,tag,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1644,Watched,1417736680
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,computer animation,1183903155
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Disney animated feature,1183933307
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Pixar animation,1183934770
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,TÃ©a Leoni does not star in this movie,1245093573

## Part 11

In [5]:
new_df = movies.merge(ratings, on="movieId")
new_df.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3,4.0,944919407
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,6,5.0,858275452
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,8,4.0,833981871
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,10,4.0,943497887
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,11,4.5,1230858821

In [6]:
new_df[ ((new_df["genres"].str.find("Comedy"))>0)].head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3,4.0,944919407
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,6,5.0,858275452
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,8,4.0,833981871
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,10,4.0,943497887
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,11,4.5,1230858821

In [10]:
new_df[ ((new_df["genres"].str.find("Comedy"))>0) & (new_df["rating"] > 4)].head()

,movieId,title,genres,userId,rating,timestamp
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,6,5.0,858275452
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,11,4.5,1230858821
7,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,14,4.5,1225311239
9,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,19,5.0,855176628
14,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,34,5.0,846509445

## Part 12

In [142]:
 x =pd.DataFrame(list(movies["genres"].apply(lambda x: x.split("|"))))
x.head()

,0,1,2,3,4,5,6,7,8,9
0,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None
1,Adventure,Children,Fantasy,None,None,None,None,None,None,None
2,Comedy,Romance,None,None,None,None,None,None,None,None
3,Comedy,Drama,Romance,None,None,None,None,None,None,None
4,Comedy,None,None,None,None,None,None,None,None,None

In [156]:
## verifying none values
x.loc[:,9].value_counts()
x.loc[:,9].isna().sum()

27277

In [152]:
len(x)

27278

In [155]:
x.loc[:,9].count()

1

## Part 13

In [9]:
movies["title"].apply(lambda x : x[-5:-1]).head()

0    1995
1    1995
2    1995
3    1995
4    1995
Name: title, dtype: object

## pArt 14

In [159]:
import time
import datetime
date = "01/02/2015"
timestamp = time.mktime(datetime.datetime.strptime(date, "%d/%m/%Y").timetuple())
timestamp

1422729000.0

In [163]:
tags[tags["timestamp"]>timestamp].head()

     userId  movieId      tag   timestamp
301     318      260    1970s  1424472169
302     318      260  fantasy  1424472169
303     318      260   sci-fi  1424472169
304     318   115149   Action  1424534310
305     318   115149  Revenge  1424534283

## Part15

In [11]:
tags.sort_values("timestamp").head()

        userId  movieId              tag   timestamp
333932  100371     2788     monty python  1135429210
333927  100371     1732    coen brothers  1135429236
333924  100371     1206  stanley kubrick  1135429248
333923  100371     1193   jack nicholson  1135429371
333939  100371     5004    peter sellers  1135429399

In [15]:
tags["newDate"] = tags["timestamp"].apply(lambda x: pd.to_datetime(x, unit="s"))

In [16]:
tags["newDate"].head()

0   2009-04-24 18:19:40
1   2013-05-10 01:41:18
2   2013-05-10 01:41:19
3   2013-05-10 01:39:43
4   2013-05-10 01:41:18
Name: newDate, dtype: datetime64[ns]

In [21]:
tags[tags["newDate"] > "2015-02-01"]

,userId,movieId,tag,timestamp,newDate
301,318,260,1970s,1424472169,2015-02-20 22:42:49
302,318,260,fantasy,1424472169,2015-02-20 22:42:49
303,318,260,sci-fi,1424472169,2015-02-20 22:42:49
304,318,115149,Action,1424534310,2015-02-21 15:58:30
305,318,115149,Revenge,1424534283,2015-02-21 15:58:03
306,318,115149,Willem Dafoe,1424534383,2015-02-21 15:59:43
324,342,318,masterplan,1423424898,2015-02-08 19:48:18
326,342,318,prison escape,1423424898,2015-02-08 19:48:18
327,342,318,redemption,1423424898,2015-02-08 19:48:18
589,342,108190,based on a book,1426978115,2015-03-21 22:48:35
590,342,108190,dystopia,1426978076,2015-03-21 22:47:56
1018,370,6975,breaking the fourth wall,1425242234,2015-03-01 20:37:14
1019,370,27592,violent,1425241975,2015-03-01 20:32:55
2203,969,97,class conflict,1426754226,2015-03-19 08:37:06
2204,969,288,mindfuck,1426752631,2015-03-19 08:10:31
2205,969,288,paranoid,1426752639,2015-03-19 08:10:39
2206,969,288,psychedelic,1426752634,2015-03-19 08:10:34
2207,969,1263,american propaganda,1426753995,2015-03-19 08:33:15
2208,969,3742,class conflict,1426753876,2015-03-19 08:31:16
2209,969,3742,Classic,1426754311,2015-03-19 08:38:31
2210,969,3742,Propaganda,1426754337,2015-03-19 08:38:57
2211,969,4848,Atmospheric,1426752575,2015-03-19 08:09:35
2212,969,4848,dark,1426752581,2015-03-19 08:09:41
2213,969,4848,Mindfuck,1426752569,2015-03-19 08:09:29
2214,969,6530,claustrophobic,1426753144,2015-03-19 08:19:04
2215,969,6530,mental illness,1426751285,2015-03-19 07:48:05
2216,969,6530,suicide,1426751289,2015-03-19 07:48:09
2217,969,8950,depressing,1426749117,2015-03-19 07:11:57
2218,969,8950,psychodrama,1426752695,2015-03-19 08:11:35
2219,969,8950,schizophrenia,1426752689,2015-03-19 08:11:29
...,...,...,...,...,...
461895,137227,120222,horribly animated,1422821079,2015-02-01 20:04:39
461896,137227,120222,nazi imagery,1422821051,2015-02-01 20:04:11
461897,137227,120222,racist,1422821047,2015-02-01 20:04:07
461898,137227,120222,racist stereotypes,1422821071,2015-02-01 20:04:31
462190,137249,296,influential,1423437040,2015-02-08 23:10:40
462191,137249,296,neo-noir,1423437040,2015-02-08 23:10:40
462192,137249,296,quentin tarantino,1423437040,2015-02-08 23:10:40
462195,137277,110052,"marcello mastroianni,",1422925214,2015-02-03 01:00:14
462979,137924,46855,Criterion,1427722627,2015-03-30 13:37:07
462980,137924,46855,French Resistance,1427722622,2015-03-30 13:37:02
462981,137924,46855,World War II,1427722614,2015-03-30 13:36:54
463004,138063,4355,Hockey,1424230535,2015-02-18 03:35:35
463005,138063,108160,Hockey,1424230501,2015-02-18 03:35:01
463504,138103,67894,finnish,1423255773,2015-02-06 20:49:33
463509,138103,69442,finnish,1423255750,2015-02-06 20:49:10
463544,138103,73501,finnish,1423255756,2015-02-06 20:49:16
463545,138103,74681,finnish,1423255760,2015-02-06 20:49:20
463573,138103,84553,finnish,1423255764,2015-02-06 20:49:24
464786,138301,52042,espionage,1426032479,2015-03-11 00:07:59
464787,138301,52042,resistance movement,1426032481,2015-03-11 00:08:01
464788,138301,52042,World War II,1426032485,2015-03-11 00:08:05
464958,138301,109487,ambitious,1423178287,2015-02-05 23:18:07
464959,138301,109487,atmosphere,1423178302,2015-02-05 23:18:22
464960,138301,109487,plot holes,1423178186,2015-02-05 23:16:26
464961,138301,109487,sci-fi,1423178227,2015-02-05 23:17:07
464962,138301,109487,science fiction,1423178255,2015-02-05 23:17:35
464963,138301,109487,Self-Indulgent,1423178219,2015-02-05 23:16:59
464964,138301,109487,space,1423178343,2015-02-05 23:19:03
464965,138301,109487,visually appealing,1423178319,2015-02-05 23:18:39
464966,138301,109487,wasted potential,1423178212,2015-02-05 23:16:52